---
kind: method
id: M:Autodesk.Revit.DB.PhaseArrayIterator.#ctor
source: html/9d249c86-1068-ada3-f643-bc4f47183d9f.htm
---
# Autodesk.Revit.DB.PhaseArrayIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public PhaseArrayIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.